Revit 2027 API
Macro.MacroModule Property
 The Macro module.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MacroModule MacroModule { get; }
Public ReadOnly Property MacroModule As MacroModule
	Get
public:
property MacroModule^ MacroModule {
	MacroModule^ get ();
}
member MacroModule : MacroModule with get
Property Value
MacroModule
See Also
Reference
Macro Class
Autodesk.Revit.DB.Macros Namespace